{
  "page 1": [
    "California Department of Transportation (Caltrans) Invitation for Bid (IFB) #03A3974: Hot Mix Asphalt (HMA) Concrete Grinder Dig-Out Repair and Replacement Paving in multiple California counties. Includes SB/DVBE participation goals and Prevailing Wage requirements.\n"
  ],
  "page 2": [
    "*   **Purpose of Services**\n*   **Description of Services**\n",
    "*   **Bidder Qualifications**\n*   **Minimum Requirements**\n",
    "Bidder Minimum Qualifications: Valid DIR Registration required at bid submittal and throughout the agreement duration. Caltrans will verify registration.\n",
    "Bidder's Minimum Qualifications: CSLB License certification (appropriate classification required) under penalty of perjury.\n",
    "*   **Bidder Minimum Qualifications:** Failure to meet requirements results in non-responsive bid.\n*   **Caltrans Opinion:** Determines if minimum qualifications are met.\n",
    "*   **Bid Requirements**\n*   **Bid Information**\n",
    "*   **Bid Requirements**\n*   **Time Schedule**\n",
    "Bid Requirements, Questions, Answers.\n(Focuses on the information provided about bids through a Q&A format.)\n",
    "Bid Requirements, Questions and Answers, Site Inspection.\nBidders attending site inspection should bring written questions.\n",
    "Bid Requirements, Questions and Answers, IFB, Deadline: April 16, 2025, Email Submission: esmeralda.rojo@dot.ca.gov.\n",
    "Bid Requirements; Questions and Answers. Written questions must include name, firm, email, and IFB No. 03A3974.\n",
    "Bid Requirements/Information: Questions & Answers. Responses will be posted as an Addendum on the Cal eProcure website; bidders are responsible for checking the site.\n"
  ],
  "page 3": [
    "*   **Bid Requirements**\n*   **Bid Rate Costs**\n",
    "Bid Requirements, Undocumented Workers\nEmployment Restrictions\n",
    "*   **Bid Requirements**\n*   **Small Business Preference**\n",
    "Bid Requirements, Prevailing Wage Rates.\nSpecifically, State General Prevailing Wage Rates are relevant to the bidding process.\n",
    "*   **Bid Requirements: Organic Waste Recycling**\n*   **Mandatory Recycling for Bids**\n",
    "*   **Bid Requirements: Motor Carrier Permit**\n*   **Motor Carrier Permit Requirements**\n",
    "Motor Carrier Permit (MCP) Requirements: Contractor responsibility to determine if California Vehicle Code requires a valid MCP from DMV.\n"
  ],
  "page 4": [
    "Keywords: Motor Carrier Permit (MCP), Requirements, California Vehicle Code, Contractor Responsibility, Caltrans Request.\n\nKey Points: Contractor must maintain valid MCPs for their motor carriers of property as required by California law and provide proof to Caltrans upon request.\n",
    "*   **Bid Requirements**\n*   **Contractor Registration**\n",
    "Contractor Registration Program: Mandatory DIR registration for contractors and subcontractors on prevailing wage contracts, as per Labor Code Section 1725.5, with limited exceptions.\n",
    "*   **Contractor Registration (DIR):** Mandatory for contractors/subcontractors awarded agreements with prevailing wages per Labor Code 1725.5.\n",
    "*   **Bid Requirements: Contractor Registration** (DIR)\n*   **Caltrans verifies registration; non-compliance leads to bid rejection.**\n",
    "*   **Bid Requirements**\n*   **Contractor's License**\n",
    "*   **Bid Requirements**\n*   **Subcontractors**\n",
    "*   **Bid Requirements:** Title VI/Nondiscrimination Assurances\n*   **DOT Order No. 1050.2A:** Standard Compliance\n",
    "*   **Bid Requirements**\n*   **Non-Collusion Declaration** (for Public Works)\n"
  ],
  "page 5": [
    "*   **Bid Requirements**\n*   **Bonds**\n",
    "Bid Requirements: Bonds, Bidder's Bond (ADM-2010).\nRequired for bids $461,000+, must be 10% of total bid, executed by surety insurer.\n",
    "Payment Bond Requirement: 100% of Service Request price required if over $25,000, prior to work commencement.\n",
    "*   **Bid Requirements**\n*   **Insurance**\n",
    "Bid requirements, Insurance: Successful bidder must provide Certificate of Insurance to Procurement and Contracts within 10 days of award notification.\n",
    "*   **Bid Requirements/Information: Insurance**\n*   **Additional Insured Endorsement Required**\n",
    "*   **Bid Requirements:** Insurance, Certificate of Insurance\n*   **Additional Insured Endorsement Required:** Must accompany certificate.\n",
    "*   **Insurance, Self-Insured Retention (SIR)**\n*   **Bid Requirements: Insurance, SIR**\n",
    "Bid Requirements, Insurance, Coverages/Limits.\n(Focus: Bids require specific insurance types and coverage amounts).\n",
    "*   **Bid Requirements**\n*   **California Civil Rights Laws**\n"
  ],
  "page 6": [
    "*   **Bid Requirements**\n*   **Darfur Contracting Act**\n",
    "*   **Darfur Contracting Act:** Applies to companies with business activities outside the US within the past 3 years.\n*   **Bid Requirements:** Contractors must comply with Public Contract Code Section 10475-10481 regarding the Darfur Contracting Act.\n",
    "*   **Darfur Contracting Act:** Compliance required for companies with international business activities.\n*   **DOT ADM-0077:** Complete Option 1 if no international business in past 3 years.\n",
    "Darfur Contracting Act: Scrutinized companies (doing business in Sudan) are ineligible to bid on state agreements.\n",
    "*   **Darfur Contracting Act:** Public Contract Code Section 10478(a)\n*   **Certification Required:** Companies with business activities outside the US must certify they are not a \"scrutinized\" company.\n",
    "Darfur Contracting Act: Scrutinized companies can still bid with permission from the Department of General Services based on established criteria.\n",
    "*   **Bid Requirements**\n*   **Iran Contracting Act**\n",
    "Iran Contracting Act of 2010 restricts entities on the Public Contract Code Section 2202.5 \"List\" from bidding on contracts.\nKey points: Iran Contracting Act, ineligible bidders, Public Contract Code Section 2202.5 (\"List\").\n",
    "*   **Iran Contracting Act Certification:** Mandatory form (DOT ADM-0078) required with bid proposal.\n*   **Certification Requirement:** Bidder must certify they are not on Iran contracting list.\n",
    "Iran Contracting Act, Caltrans DOT ADM-0078: Certification required from contractors (for exempted, renewed, or otherwise awarded agreements) confirming they are not on the prohibited \"List.\"\n",
    "*   **Bid Requirements**\n*   **Executive Order N-6-22**\n*   **Russia Sanctions**\n"
  ],
  "page 7": [
    "Bid Requirements, Executive Order N-12-23, Generative Artificial Intelligence (GenAI), Technology Use.\nKey points: Bidding context, specific executive order related to the use of GenAI technology.\n",
    "*   **Bid Requirements**\n*   **Information Reporting**\n",
    "*   **Bid Requirements**\n*   **Bid Submittal**\n",
    "**Bid Submittal Requirements:** Bids must be submitted to Caltrans Division of Procurement and Contracts, Bid Unit, by the deadlines specified in Section C.\n",
    "*   **Bid Submittal**\n*   **Mailing Package Labeling**\n"
  ],
  "page 8": [
    "*   **Bid Requirements/Information**\n*   **Bid Submittal**\n*   **Late Bids Not Considered**\n",
    "**Bid Requirements & Submittal:** All bids must include required documents (listed in the IFB) or risk being deemed non-responsive.\n",
    "Bid Requirements; Bid Submittal; Authorized Signature Required; Legally binding signature needed on all documents.\n",
    "Bid Submittal: Hand-delivered bids require immediate date/time stamping upon arrival in the lobby (first floor, right of security).\n",
    "Bid Requirements, Bid Submittal, Bid Opening, Teleconference, 2:30 p.m., 1-866-700-7952, Passcode 7089821#\n",
    "Bid Requirements, Bid Submittal: Bids must include all services described; modifications to the bid document/work specifications will result in rejection.\n",
    "Bid Requirements, Bid Submittal, Bid Rejection (Conditional, Incomplete, Altered), Non-Responsive/Non-Responsible Bidder, Waiver.\n"
  ],
  "page 9": [
    "*   **Bid Requirements:** Submittal.\n*   **Bidder Responsibility:** Costs for bid development/anticipation of award are bidder's sole responsibility, not chargeable to the State.\n",
    "Bid Requirements, Bid Submittal, Authorized Signature, Bidder Certification Sheet, Title/Position Required.\n(Focus on mandatory signature authority for valid bid submission.)\n",
    "*   **Bid Submittal:** Modification allowed by withdrawing and resubmitting before the deadline.\n*   **Bid Modifications:** Other modification methods (oral/written) are not accepted.\n",
    "Bid Requirements; Bid Submittal; Bid Withdrawal: Written request to Caltrans (DPAC.BidUnit@dot.ca.gov) required before bid opening, signed by bidder or authorized agent.\n",
    "*   **Bid Requirements/Information**\n*   **Bid Submittal**\n*   **IFB Modification (Addendum)**\n",
    "Key points: Bid requirements, bid submittal, Caltrans right to reject bids.\nKeywords: Bid requirements, bid submittal, bid rejection, Caltrans.\n",
    "Bid Submittal; Bid Requirements; Bidder Responsibility (for accurate documents). Bidders should proof documents for errors before submission.\n",
    "Bid Requirements & Submittal: Site investigation required. Bidders must examine work sites, specifications, and subsurface conditions. No additions or increases allowed due to unforeseen conditions.\n",
    "*   **Bid Requirements:** No alternate agreement language or negotiation of State's General Terms and Conditions (GTC) is allowed.\n*   **Bid Rejection:** Bids with such language will be rejected as counter proposals.\n",
    "Bid Requirements, Evaluation, and Selection.\nKey areas for bidding process: outlining requirements and how bids will be assessed.\n",
    "Bid Requirements, Evaluation, and Selection. Key points: Bid opening, public reading of total bid amount and small business information, preliminary status pending verification of requirements.\n",
    "Bid Requirements, Evaluation & Selection.\nKey focus: verifying required documents to determine bid responsiveness to State's needs.\n",
    "Bid Requirements, Evaluation & Selection.\n\nKey point: False or misleading bids/references will be rejected.\n",
    "Bid Requirements, Evaluation & Selection, Agreement Award.\n\nLowest bid meeting specifications wins; compliance with solicitation requirements is crucial.\n"
  ],
  "page 10": [
    "*   **Bid Requirements**\n*   **Award**\n",
    "Bid Requirements, Award, Preliminary Bid Results, Online Viewing, After 3:00 PM, First Business Day After Bid Due Date, URL provided.\n",
    "**Competitive bidding, award process, low bidder notification.**\n**Non-low bidder award requires 5-day notice to low bidder.**\n",
    "Bid Requirements, Award, Notice of Intent to Award, Public Posting, Online Availability (dot.ca.gov).\n",
    "*   **Bid Requirements, Award:** Contractor responsibilities after agreement award.\n*   **Payee Data Record (STD 204):** Submission required for state income tax withholding determination (California Revenue and Taxation Code Section 18662).\n",
    "*   **Bid Requirements**\n*   **Protest**\n",
    "*   **Bid Protest:** Bidders can protest Caltrans agreement awards.\n*   **Protest Procedures:** Specific processes and procedures apply.\n",
    "*   **Bid Protest Requirements:** Filing deadline before agreement award.\n*   **Caltrans Protest Unit:** Initial protest submission point.\n",
    "*   **Bid Protest Requirements:** Protest filing deadlines (5 days), full written statement specifying grounds required by Caltrans Protest Unit.\n",
    "*   **Bid Requirements**\n*   **Standard Conditions of Service**\n",
    "*   **Bid Requirements:** Standard Conditions of Service.\n*   **Contractor Failure:** Failure to commence work or suspension of work after agreement execution.\n"
  ],
  "page 11": [
    "Bid Requirements, Standard Conditions of Service.\nAgreement performance must be completed by the termination date.\n",
    "Bid Requirements, Standard Conditions of Service, Antitrust Provisions.\nEssentially: Bidding rules covering service terms and antitrust compliance.\n",
    "*   **Bid Requirements:** Antitrust Provisions\n*   **Contractor Agreement:** Assignment of Clayton Act Rights (Section 4) to Awarding Body.\n",
    "Bid Requirements, Standard Conditions of Service, Antitrust Provisions.\nReimbursement for legal costs incurred in antitrust actions assigned under Government Code Sections 4550-4554.\n",
    "Bid Requirements; Standard Conditions of Service; Agreement Signing Refusal: Liability for Damages (Caltrans).\n",
    "Bid Requirements, Standard Conditions of Service: **No oral agreements are binding.**\n",
    "*   **Special Programs**\n",
    "**Keywords/Key Points:**\n\nSpecial Programs, Small Business (SB), Microbusiness (MB), Public Works (SB-PW) Preference.\n",
    "Special Programs: Small Business (SB), Microbusiness (MB), SB-PW Preference.\nGovernment Code Section 14835 et seq. mandates a 5% preference for Certified SB, MB, and SB-PW contractors.\n"
  ],
  "page 12": [
    "Keywords: Special Programs, Small Business (SB) Preference, Microbusiness (MB), Small Business for Public Works (SB-PW), California, Certification, DGS.\nKey Points: SB/MB/SB-PW preference available for California-based businesses certified by DGS.\n",
    "Small Business (SB) Preference (including MB, SB-PW): Eligibility for non-small business (NSB) preference requires subcontracting at least 25% if not SB certified, per Gov Code 14838 and 2 CCR 1896.\n",
    "Special Programs, Small Business (SB)/Microbusiness (MB) Preference: Certified SB/MB bidders prioritized over NSB bidders when applying SB preferences.\n",
    "**Small Business (SB) Preference Program:** SB, MB, and SB-PW preferences exist, but only for responsive and responsible bidders.\n",
    "Small Business (SB), Microbusiness (MB), SB-PW Preference; Certification approval process; OSDS contact information (phone, email).\n",
    "Small Business (SB) / Microbusiness (MB) Preference: 5% bid preference granted to SB/MB bidders (or Non-Small Businesses using SB preference) if the lowest bid is from a non-certified SB/MB.\n",
    "*   **Small Business (SB), Microbusiness (MB), SB-PW Preference**\n*   **Certification/Application (Reference Link: dgs.ca.gov)**\n",
    "*   **Disabled Veteran Business Enterprise (DVBE)**\n*   **Special Programs**\n",
    "*   **Disabled Veteran Business Enterprise (DVBE)**\n*   **DVBE Participation Program**\n*   **Participation Requirements**\n",
    "Disabled Veteran Business Enterprise (DVBE) Programs: DVBE Participation Program, 3% participation requirement, State funds, Public Contract Code Section 10115 et seq., Military and Veterans Code Section 999 et seq.\n",
    "Disabled Veteran Business Enterprise (DVBE) Programs: DVBE Participation Program requirements include completing and submitting specified certification and declaration forms (GSPD-05-105, STD 843).\n"
  ],
  "page 13": [
    "Disabled Veteran Business Enterprise (DVBE) Programs, DVBE Participation Program, DVBE Program Requirements (link to CA.gov PDF).\n",
    "Disabled Veteran Business Enterprise (DVBE) Programs with Participation Requirements. Reference: DVBE Certification/Re-application.\n",
    "*   Disabled Veteran Business Enterprise (DVBE)\n*   DVBE Incentive Program\n",
    "*   **Disabled Veteran Business Enterprise (DVBE) Incentive Program:** Applies to the solicitation.\n*   **Separate from DVBE Participation Program:** Established in Military and Veterans Code Sections 999 et seq., and Title 2, California Code of Regulations.\n",
    "DVBE (Disabled Veteran Business Enterprise) Programs & Incentive. Caltrans applies incentive to bids utilizing DGS-certified DVBE firms (verified via GSPD-05-105) prior to contract award.\n",
    "*   **DVBE (Disabled Veteran Business Enterprise) Incentive Program**\n*   **IFB (Low Price Method) Tables**\n",
    "DVBE (Disabled Veteran Business Enterprise) Incentive Program.\nNSB (Non-Small Business) award shall not displace DGS Certified Small Business.\n"
  ],
  "page 14": [
    "Disabled Veteran Business Enterprise (DVBE) Program:\nDVBE Incentive Program, DVBE Program Requirements (link provided).\n",
    "Disabled Veteran Business Enterprise (DVBE), Incentive Program, Certification/Re-application.\nCalifornia Procurement (dgs.ca.gov)\n"
  ],
  "page 15": [
    "*   **Daily employment**\n*   **Short-term labor**\n",
    "*   **Day Work**\n*   **Night Work**\n",
    "*   **Daily labor**\n*   **Short-term employment**\n",
    "Day work, fibrous asphalt, up to 12' width.\nKey aspects: Daily rate labor using fibrous asphalt, specifically for sections up to 12 feet wide.\n",
    "*   **Night Work**\n*   **Working at Night**\n",
    "*   **Night Work:** Indicates work performed during nighttime hours.\n*   **Fibrous Asphalt:** Specifies a type of asphalt material used.\n*   **12' Width:** Limits the width of the work area or material application.\n"
  ],
  "page 16": [
    "*   **Daily Labor:** Focuses on work performed and compensated on a single-day basis.\n*   **Short-Term Employment:** Highlights the temporary nature of the work arrangement.\n",
    "*   Day work\n*   Night work\n\nKey points: Work schedules differentiated by time of day.\n",
    "*   **Day Labor/Work:** Focuses on work done within a single day.\n*   **Temporary Employment:** Implies short-term job assignments.\n",
    "*   **Day Work**\n*   **Fibrous Asphalt**\n*   **Width up to 12'**\n",
    "*   **Night Work**\n*   **Working at Night**\n",
    "*   **Night Work**\n*   **Fibrous Asphalt**\n*   **Width Limit: Up to 12 feet**\n"
  ],
  "page 17": [
    "*   **Day Labor:** Short-term employment for a single day.\n*   **Temporary Work:** Focusing on work done on a daily basis.\n",
    "*   **Day Work**\n*   **Night Work**\n",
    "*   **Day Work**\n*   **Additional Flaggers**\n",
    "*   **Day Work**\n*   **Type 1 Traffic Control**\n",
    "*   **Day Work**\n*   **Type 2 Traffic Control**\n",
    "*   **Day Work**\n*   **Portable Changeable Message Sign (PCMS/FAS)**\n"
  ]
}